---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyDisassembleInstanceWarn
source: html/47ffb46d-7bda-074b-dd60-8104b006fc82.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyDisassembleInstanceWarn Property

Edits to these assemblies changed the naming category and name of these assemblies.

## Syntax (C#)
```csharp
public static FailureDefinitionId AssemblyDisassembleInstanceWarn { get; }
```